Repository: RishiAhuja/KisaanMithraa
Catalog: lib/l10n/intl_*.arb
Languages: hi, pa

# appTitle
source: Kisan Mitra
hi: किसान मित्र
pa: ਕਿਸਾਨ ਮਿੱਤਰ

# welcome
source: Welcome back,
hi: वापस स्वागत है,
pa: ਵਾਪਸ ਸੁਆਗਤ ਹੈ,

source: Create Cooperative
hi: सहकारी बनाएं
pa: ਸਹਿਕਾਰੀ ਬਣਾਓ

# personalInfo
source: Personal Information
hi: व्यक्तिगत जानकारी
pa: ਨਿੱਜੀ ਜਾਣਕਾਰੀ

source: Farm Details
hi: खेत की जानकारी
pa: ਖੇਤ ਦੀ ਜਾਣਕਾਰੀ

source: Ask Mitra
hi: मित्र से पूछें
pa: ਮਿੱਤਰ ਤੋਂ ਪੁੱਛੋ

source: Soil Type
hi: मिट्टी का प्रकार
pa: ਮਿੱਟੀ ਦਾ ਪ੍ਰਕਾਰ

source: Location
hi: स्थान
pa: ਸਥਾਨ

source: Crops
hi: फसलें
pa: ਫਸਲਾਂ

source: Phone
hi: फोन
pa: ਫੋਨ

source: Member since
hi: सदस्य बने
pa: ਮੈਂਬਰ ਤੋਂ

source: Location not set
hi: स्थान सेट नहीं है
pa: ਸਥਾਨ ਸੈੱਟ ਨਹੀਂ ਹੈ

# noCrops
source: No crops specified
hi: कोई फसल निर्दिष्ट नहीं
pa: ਕੋਈ ਫਸਲ ਨਿਰਧਾਰਤ ਨਹੀਂ

source: Not specified
hi: निर्दिष्ट नहीं
pa: ਨਿਰਧਾਰਤ ਨਹੀਂ

# askAnything
source: Ask me anything about farming
hi: खेती के बारे में कुछ भी पूछें
pa: ਖੇਤੀਬਾੜੀ ਬਾਰੇ ਕੁਝ ਵੀ ਪੁੱਛੋ

source: Start Speaking
hi: बोलना शुरू करें
pa: ਬੋਲਣਾ ਸ਼ੁਰੂ ਕਰੋ

source: Initializing...
hi: आरंभ हो रहा है...
pa: ਸ਼ੁਰੂ ਹੋ ਰਿਹਾ ਹੈ...

# bestCrops
source: Best crops for this season
hi: इस मौसम के लिए सबसे अच्छी फसलें
pa: ਇਸ ਮੌਸਮ ਲਈ ਵਧੀਆ ਫਸਲਾਂ

# bestCropsQuestion
source: What are the best crops to plant this season?
hi: इस मौसम में कौन सी फसलें लगानी चाहिए?
pa: ਇਸ ਮੌਸਮ ਵਿੱਚ ਕਿਹੜੀਆਂ ਫਸਲਾਂ ਲਗਾਉਣੀਆਂ ਚਾਹੀਦੀਆਂ ਹਨ?

# pestControl
source: Pest control tips
hi: कीट नियंत्रण टिप्स
pa: ਕੀੜੇ ਨਿਯੰਤਰਣ ਸੁਝਾਅ

# pestControlQuestion
source: How can I deal with common pests?
hi: आम कीटों से कैसे निपटें?
pa: ਆਮ ਕੀੜਿਆਂ ਨਾਲ ਕਿਵੇਂ ਨਜਿੱਠਿਆ ਜਾਵੇ?

source: Water conservation
hi: पानी का संरक्षण
pa: ਪਾਣੀ ਦਾ ਸੰਰਖਿਅਣ

# waterConservationQuestion
source: How can I conserve water?
hi: पानी कैसे बचाएं?
pa: ਪਾਣੀ ਕਿਵੇਂ ਬਚਾਇਆ ਜਾਵੇ?

source: Organic farming
hi: जैविक खेती
pa: ਜੈਵਿਕ ਖੇਤੀ

# organicFarmingQuestion
source: Tips for organic farming?
hi: जैविक खेती के लिए सुझाव?
pa: ਜੈਵਿਕ ਖੇਤੀ ਲਈ ਸੁਝਾਅ?

# askFarmingQuestion
source: Ask anything about farming...
hi: खेती के बारे में कुछ भी पूछें...
pa: ਖੇਤੀਬਾੜੀ ਬਾਰੇ ਕੁਝ ਵੀ ਪੁੱਛੋ...

# speechInitializing
source: Speech recognition is initializing. Please wait...
hi: भाषण पहचान आरंभ हो रही है। कृपया प्रतीक्षा करें...
pa: ਭਾਸ਼ਣ ਪਛਾਣ ਸ਼ੁਰੂ ਹੋ ਰਹੀ ਹੈ। ਕਿਰਪਾ ਕਰਕੇ ਉਡੀਕ ਕਰੋ...

source: Recognized: "
hi: पहचाना गया: "
pa: ਪਛਾਣਿਆ ਗਿਆ: "

# speechError
source: Speech recognition error:
hi: भाषण पहचान त्रुटि:
pa: ਭਾਸ਼ਣ ਪਛਾਣ ਗਲਤੀ:

source: Priority Alerts
hi: प्राथमिकता अलर्ट
pa: ਪ੍ਰਾਥਮਿਕਤਾ ਅਲਰਟ

source: View all
hi: सभी देखें
pa: ਸਾਰੇ ਵੇਖੋ

# heavyRainAlert
source: Heavy rain expected in next 3 days, secure your wheat crop
hi: अगले 3 दिनों में भारी बारिश की उम्मीद है, अपनी गेहूं की फसल को सुरक्षित करें
pa: ਅਗਲੇ 3 ਦਿਨਾਂ ਵਿੱਚ ਭਾਰੀ ਮੀਂਹ ਦੀ ਉਮੀਦ ਹੈ, ਆਪਣੀ ਕਣਕ ਦੀ ਫਸਲ ਨੂੰ ਸੁਰੱਖਿਅਤ ਕਰੋ

source: View Tips
hi: सुझाव देखें
pa: ਸੁਝਾਅ ਵੇਖੋ

# chooseLanguage
source: Choose Your Language
hi: अपनी भाषा चुनें
pa: ਆਪਣੀ ਭਾਸ਼ਾ ਚੁਣੋ

source: Community
hi: समुदाय
pa: ਭਾਈਚਾਰਾ

source: Farmers
hi: किसान
pa: ਕਿਸਾਨ

source: Cooperatives
hi: सहकारी समितियां
pa: ਸਹਿਕਾਰੀ ਸੰਸਥਾਵਾਂ

source: Search...
hi: खोजें...
pa: ਖੋਜ...

source: Contact Information
hi: संपर्क जानकारी
pa: ਸੰਪਰਕ ਜਾਣਕਾਰੀ

source: City
hi: शहर
pa: ਸ਼ਹਿਰ

source: State
hi: राज्य
pa: ਰਾਜ

source: Farming Details
hi: खेती की जानकारी
pa: ਖੇਤੀਬਾੜੀ ਦੇ ਵੇਰਵੇ

# messageUser
source: Message Farmer
hi: किसान को संदेश भेजें
pa: ਕਿਸਾਨ ਨੂੰ ਸੁਨੇਹਾ ਭੇਜੋ

source: About
hi: परिचय
pa: ਬਾਰੇ

source: Total Members
hi: कुल सदस्य
pa: ਕੁੱਲ ਮੈਂਬਰ

source: Admin
hi: व्यवस्थापक
pa: ਪ੍ਰਬੰਧਕ

source: Join Cooperative
hi: सहकारी में शामिल हों
pa: ਸਹਿਕਾਰੀ ਵਿੱਚ ਸ਼ਾਮਲ ਹੋਵੋ

source: Coming Soon
hi: जल्द आ रहा है
pa: ਜਲਦੀ ਆ ਰਿਹਾ ਹੈ

# messagingFeature
source: Messaging feature will be available soon!
hi: संदेश सुविधा जल्द ही उपलब्ध होगी!
pa: ਸੁਨੇਹਾ ਸੁਵਿਧਾ ਜਲਦੀ ਹੀ ਉਪਲਬਧ ਹੋਵੇਗੀ!

source: Notifications
hi: सूचनाएं
pa: ਸੂਚਨਾਵਾਂ

source: No notifications yet
hi: अभी तक कोई सूचना नहीं
pa: ਅਜੇ ਤਕ ਕੋਈ ਸੂਚਨਾਵਾਂ ਨਹੀਂ

source: Create Listing
hi: लिस्टिंग बनाएं
pa: ਲਿਸਟਿੰਗ ਬਣਾਓ

source: Listing Type
hi: लिस्टिंग प्रकार
pa: ਲਿਸਟਿੰਗ ਦਾ ਪ੍ਰਕਾਰ

source: Transaction Type
hi: लेनदेन प्रकार
pa: ਲੈਣ-ਦੇਣ ਦਾ ਪ੍ਰਕਾਰ

source: Title
hi: शीर्षक
pa: ਸਿਰਲੇਖ

source: Description
hi: विवरण
pa: ਵੇਰਵਾ

source: Quantity
hi: मात्रा
pa: ਮਾਤਰਾ

source: Unit
hi: इकाई
pa: ਇਕਾਈ

source: Price per unit (₹)
hi: प्रति इकाई मूल्य (₹)
pa: ਪ੍ਰਤੀ ਇਕਾਈ ਮੁੱਲ (₹)

source: Availability
hi: उपलब्धता
pa: ਉਪਲਬਧਤਾ

source: From
hi: से
pa: ਤੋਂ

source: To
hi: तक
pa: ਤੱਕ

source: Select Date
hi: तिथि चुनें
pa: ਮਿਤੀ ਚੁਣੋ

source: Required
hi: आवश्यक
pa: ਲੋੜੀਂਦਾ

source: Invalid number
hi: अमान्य संख्या
pa: ਅਵੈਧ ਨੰਬਰ

source: Invalid price
hi: अमान्य मूल्य
pa: ਅਵੈਧ ਮੁੱਲ

source: Create
hi: बनाएं
pa: ਬਣਾਓ

source: Creating...
hi: बना रहे हैं...
pa: ਬਣਾ ਰਹੇ ਹਾਂ...

source: Start Your Cooperative
hi: अपनी सहकारी शुरू करें
pa: ਆਪਣੀ ਸਹਿਕਾਰੀ ਸ਼ੁਰੂ ਕਰੋ

# createCommunity
source: Create a community of farmers working together
hi: एक साथ काम करने वाले किसानों का समुदाय बनाएं
pa: ਇਕੱਠੇ ਕੰਮ ਕਰਨ ਵਾਲੇ ਕਿਸਾਨਾਂ ਦਾ ਭਾਈਚਾਰਾ ਬਣਾਓ

source: Cooperative Name
hi: सहकारी का नाम
pa: ਸਹਿਕਾਰੀ ਦਾ ਨਾਮ

source: Enter cooperative name
hi: सहकारी का नाम दर्ज करें
pa: ਸਹਿਕਾਰੀ ਦਾ ਨਾਮ ਦਰਜ ਕਰੋ

# describeCooperative
source: Describe your cooperative's mission and goals
hi: अपनी सहकारी के मिशन और लक्ष्यों का वर्णन करें
pa: ਆਪਣੀ ਸਹਿਕਾਰੀ ਦੇ ਮਿਸ਼ਨ ਅਤੇ ਟੀਚਿਆਂ ਦਾ ਵਰਣਨ ਕਰੋ

source: Select Members
hi: सदस्य चुनें
pa: ਮੈਂਬਰ ਚੁਣੋ

source: Optional
hi: वैकल्पिक
pa: ਵਿਕਲਪਿਕ

source: Cooperative Banner
hi: सहकारी बैनर
pa: ਸਹਿਕਾਰੀ ਬੈਨਰ

source: Add Banner
hi: बैनर जोड़ें
pa: ਬੈਨਰ ਜੋੜੋ

# uploadBanner
source: Upload a banner for your cooperative
hi: अपनी सहकारी के लिए एक बैनर अपलोड करें
pa: ਆਪਣੀ ਸਹਿਕਾਰੀ ਲਈ ਬੈਨਰ ਅਪਲੋਡ ਕਰੋ

source: Select Image Source
hi: छवि स्रोत चुनें
pa: ਚਿੱਤਰ ਸਰੋਤ ਚੁਣੋ

source: Camera
hi: कैमरा
pa: ਕੈਮਰਾ

source: Gallery
hi: गैलरी
pa: ਗੈਲਰੀ

source: Listing Details
hi: लिस्टिंग विवरण
pa: ਲਿਸਟਿੰਗ ਵੇਰਵੇ

source: My Listing Details
hi: मेरी लिस्टिंग विवरण
pa: ਮੇਰੀ ਲਿਸਟਿੰਗ ਵੇਰਵੇ

source: Offers
hi: प्रस्ताव
pa: ਪੇਸ਼ਕਸ਼ਾਂ

source: No offers yet
hi: अभी कोई प्रस्ताव नहीं
pa: ਅਜੇ ਕੋਈ ਪੇਸ਼ਕਸ਼ ਨਹੀਂ

source: Make Offer
hi: प्रस्ताव करें
pa: ਪੇਸ਼ਕਸ਼ ਕਰੋ

source: Submit
hi: जमा करें
pa: ਜਮ੍ਹਾਂ ਕਰੋ

source: Cancel
hi: रद्द करें
pa: ਰੱਦ ਕਰੋ

source: Cancel Listing
hi: लिस्टिंग रद्द करें
pa: ਲਿਸਟਿੰਗ ਰੱਦ ਕਰੋ

source: Delete Listing
hi: लिस्टिंग हटाएं
pa: ਲਿਸਟਿੰਗ ਮਿਟਾਓ

# offerSubmittedSuccess
source: Offer submitted successfully
hi: प्रस्ताव सफलतापूर्वक जमा किया गया
pa: ਪੇਸ਼ਕਸ਼ ਸਫਲਤਾਪੂਰਵਕ ਜਮ੍ਹਾਂ ਕੀਤੀ ਗਈ

source: Failed to submit offer
hi: प्रस्ताव जमा करने में विफल
pa: ਪੇਸ਼ਕਸ਼ ਜਮ੍ਹਾਂ ਕਰਨ ਵਿੱਚ ਅਸਫਲ

source: Error loading offers
hi: प्रस्ताव लोड करने में त्रुटि
pa: ਪੇਸ਼ਕਸ਼ਾਂ ਨੂੰ ਲੋਡ ਕਰਨ ਵਿੱਚ ਤਰੁੱਟੀ

source: Please enter quantity
hi: कृपया मात्रा दर्ज करें
pa: ਕਿਰਪਾ ਕਰਕੇ ਮਾਤਰਾ ਦਰਜ ਕਰੋ

source: Please enter valid quantity
hi: कृपया वैध मात्रा दर्ज करें
pa: ਕਿਰਪਾ ਕਰਕੇ ਵੈਧ ਮਾਤਰਾ ਦਰਜ ਕਰੋ

# cannotExceedQuantity
source: Cannot exceed required quantity
hi: आवश्यक मात्रा से अधिक नहीं हो सकता
pa: ਲੋੜੀਂਦੀ ਮਾਤਰਾ ਤੋਂ ਵੱਧ ਨਹੀਂ ਹੋ ਸਕਦੀ

source: Please enter price
hi: कृपया मूल्य दर्ज करें
pa: ਕਿਰਪਾ ਕਰਕੇ ਮੁੱਲ ਦਰਜ ਕਰੋ

source: Please enter valid price
hi: कृपया वैध मूल्य दर्ज करें
pa: ਕਿਰਪਾ ਕਰਕੇ ਵੈਧ ਮੁੱਲ ਦਰਜ ਕਰੋ

# postedBy
source: Posted by {name}
hi: {name} द्वारा पोस्ट किया गया
pa: {name} ਦੁਆਰਾ ਪੋਸਟ ਕੀਤਾ ਗਿਆ

# postedOn
source: Posted on {date}
hi: {date} को पोस्ट किया गया
pa: {date} ਨੂੰ ਪੋਸਟ ਕੀਤਾ ਗਿਆ

# priceValue
source: ₹{price} per {unit}
hi: ₹{price} प्रति {unit}
pa: ₹{price} ਪ੍ਰਤੀ {unit}

source: Available from
hi: उपलब्ध से
pa: ਉਪਲਬਧ ਤੋਂ

source: Available until
hi: उपलब्ध तक
pa: ਉਪਲਬਧ ਤੱਕ

source: Chat
hi: चैट
pa: ਚੈਟ

source: Accept
hi: स्वीकारें
pa: ਸਵੀਕਾਰ ਕਰੋ

source: Offer Status
hi: प्रस्ताव स्थिति
pa: ਪੇਸ਼ਕਸ਼ ਸਥਿਤੀ

source: View on Map
hi: नक्शे पर देखें
pa: ਨਕਸ਼ੇ 'ਤੇ ਵੇਖੋ

# offerCount
source: Offers ({count})
hi: प्रस्ताव ({count})
pa: ਪੇਸ਼ਕਸ਼ਾਂ ({count})

# quantityWithUnit
source: Quantity: {quantity} {unit}
hi: मात्रा: {quantity} {unit}
pa: ਮਾਤਰਾ: {quantity} {unit}

source: Cannot accept offer
hi: प्रस्ताव स्वीकार नहीं कर सकते: अमान्य प्रस्ताव आईडी
pa: ਪੇਸ਼ਕਸ਼ ਸਵੀਕਾਰ ਨਹੀਂ ਕਰ ਸਕਦੇ: ਅਵੈਧ ਪੇਸ਼ਕਸ਼ ਆਈਡੀ

source: Error
hi: त्रुटि
pa: ਤਰੁੱਟੀ

# weatherLoading
source: Fetching your local weather...
hi: आपका स्थानीय मौसम प्राप्त कर रहे हैं...
pa: ਤੁਹਾਡਾ ਸਥਾਨਕ ਮੌਸਮ ਪ੍ਰਾਪਤ ਕਰ ਰਹੇ ਹਾਂ...

# weatherUnavailable
source: Weather update unavailable
hi: मौसम की जानकारी उपलब्ध नहीं है
pa: ਮੌਸਮ ਅਪਡੇਟ ਉਪਲਬਧ ਨਹੀਂ ਹੈ

# weatherCheckManually
source: We recommend checking crop conditions manually today
hi: आज फसल की स्थिति की मैन्युअल जांच करने की सलाह देते हैं
pa: ਅਸੀਂ ਅੱਜ ਫਸਲ ਦੀ ਸਥਿਤੀ ਨੂੰ ਦਸਤੀ ਤੌਰ 'ਤੇ ਜਾਂਚਣ ਦੀ ਸਿਫਾਰਸ਼ ਕਰਦੇ ਹਾਂ

source: Good morning
hi: सुप्रभात
pa: ਸੁਭ ਸਵੇਰ

source: Good afternoon
hi: शुभ दोपहर
pa: ਸ਼ੁਭ ਦੁਪਹਿਰ

source: Good evening
hi: शुभ संध्या
pa: ਸ਼ੁਭ ਸ਼ਾਮ

# weekendFarmWish
source: Hope your weekend on the farm is going well
hi: आशा है कि आपके खेत पर सप्ताहांत अच्छा जा रहा है
pa: ਉਮੀਦ ਹੈ ਕਿ ਤੁਹਾਡਾ ਵੀਕਐਂਡ ਖੇਤ 'ਤੇ ਵਧੀਆ ਚੱਲ ਰਿਹਾ ਹੈ

# startingMonth
source: Starting a fresh month on your farm
hi: अपने खेत पर एक नए महीने की शुरुआत
pa: ਆਪਣੇ ਖੇਤ 'ਤੇ ਇੱਕ ਨਵਾਂ ਮਹੀਨਾ ਸ਼ੁਰੂ ਕਰ ਰਹੇ ਹੋ

# endingMonth
source: Wrapping up the month on your farm
hi: अपने खेत पर महीने का समापन
pa: ਆਪਣੇ ਖੇਤ 'ਤੇ ਮਹੀਨੇ ਦਾ ਸਮਾਪਨ ਕਰ ਰਹੇ ਹੋ

# welcomeBack
source: Welcome back to your farm today
hi: अपने खेत पर आपका स्वागत है
pa: ਅੱਜ ਆਪਣੇ ਖੇਤ 'ਤੇ ਵਾਪਸ ਸੁਆਗਤ ਹੈ

source: Market Prices
hi: बाज़ार भाव
pa: ਮਾਰਕੀਟ ਮੁੱਲ

source: Your Watchlist
hi: आपकी वॉचलिस्ट
pa: ਤੁਹਾਡੀ ਵਾਚਲਿਸਟ

source: See all
hi: सभी देखें
pa: ਸਾਰੇ ਵੇਖੋ

source: Showing cached prices
hi: कैश्ड कीमतें दिखा रहे हैं
pa: ਕੈਸ਼ਡ ਮੁੱਲ ਦਿਖਾ ਰਹੇ ਹਾਂ

# emptyWatchlist
source: Your watchlist is empty
hi: आपकी वॉचलिस्ट खाली है
pa: ਤੁਹਾਡੀ ਵਾਚਲਿਸਟ ਖਾਲੀ ਹੈ

# addToWatchlistHint
source: Add crops to your watchlist to see them here
hi: अपनी वॉचलिस्ट में फसलें जोड़ें उन्हें यहां देखने के लिए
pa: ਇੱਥੇ ਵੇਖਣ ਲਈ ਆਪਣੀ ਵਾਚਲਿਸਟ ਵਿੱਚ ਫਸਲਾਂ ਸ਼ਾਮਲ ਕਰੋ

source: Add to Watchlist
hi: वॉचलिस्ट में जोड़ें
pa: ਵਾਚਲਿਸਟ ਵਿੱਚ ਸ਼ਾਮਲ ਕਰੋ

# unableToLoadPrices
source: Unable to load market prices
hi: बाजार मूल्य लोड करने में असमर्थ
pa: ਮਾਰਕੀਟ ਮੁੱਲ ਲੋਡ ਕਰਨ ਵਿੱਚ ਅਸਮਰੱਥ

source: Retry
hi: पुनः प्रयास करें
pa: ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ

source: Quick Access
hi: त्वरित पहुंच
pa: ਤੇਜ਼ੀ ਨਾਲ ਪਹੁੰਚ

source: Farmer Groups
hi: किसान समूह
pa: ਕਿਸਾਨ ਸਮੂਹ

source: Podcasts
hi: पॉडकास्ट
pa: ਪੌਡਕਾਸਟ

source: Transport
hi: परिवहन
pa: ਟਰਾਂਸਪੋਰਟ

source: Loans
hi: ऋण
pa: ਕਰਜ਼ੇ

source: Weather
hi: मौसम
pa: ਮੌਸਮ

source: Help Desk
hi: सहायता केंद्र
pa: ਸਹਾਇਤਾ ਕੇਂਦਰ

source: AI Farming Tips
hi: एआई खेती टिप्स
pa: ਏਆਈ ਖੇਤੀਬਾੜੀ ਸੁਝਾਅ

source: Refresh
hi: रीफ्रेश
pa: ਰੀਫਰੈਸ਼

# gettingTips
source: Getting farming tips...
hi: खेती के टिप्स प्राप्त कर रहे हैं...
pa: ਖੇਤੀਬਾੜੀ ਸੁਝਾਅ ਪ੍ਰਾਪਤ ਕਰ ਰਹੇ ਹਾਂ...

# noTipsAvailable
source: No tips available. Tap refresh to try again.
hi: कोई टिप उपलब्ध नहीं है। पुनः प्रयास करने के लिए रीफ्रेश टैप करें।
pa: ਕੋਈ ਸੁਝਾਅ ਉਪਲਬਧ ਨਹੀਂ ਹਨ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰਨ ਲਈ ਰੀਫਰੈਸ਼ 'ਤੇ ਟੈਪ ਕਰੋ।

# weatherHumidity
source: Humidity
hi: आर्द्रता
pa: ਨਮੀ

# weatherWind
source: Wind
hi: हवा
pa: ਹਵਾ

# weatherWindUnit
source: km/h
hi: किमी/घंटा
pa: ਕਿਮੀ/ਘੰਟਾ

# weatherPressure
source: Pressure
hi: दबाव
pa: ਦਬਾਅ

# weatherPressureUnit
source: hPa
hi: हेक्टोपास्कल
pa: ਹੈਕਟੋਪਾਸਕਲ

source: All Services
hi: सभी सेवाएं
pa: ਸਾਰੀਆਂ ਸੇਵਾਵਾਂ

# farmerGroupsDesc
source: Connect with farmers in your area
hi: अपने क्षेत्र के किसानों से जुड़ें
pa: ਆਪਣੇ ਖੇਤਰ ਦੇ ਕਿਸਾਨਾਂ ਨਾਲ ਜੁੜੋ

# podcastsDesc
source: Listen to farming tips and news
hi: खेती के टिप्स और समाचार सुनें
pa: ਖੇਤੀਬਾੜੀ ਸੁਝਾਅ ਅਤੇ ਖ਼ਬਰਾਂ ਸੁਣੋ

# transportDesc
source: Find transport for your produce
hi: अपनी उपज के लिए परिवहन ढूंढें
pa: ਆਪਣੀ ਉਪਜ ਲਈ ਟਰਾਂਸਪੋਰਟ ਲੱਭੋ

# weatherDesc
source: Check local weather forecasts
hi: स्थानीय मौसम पूर्वानुमान देखें
pa: ਸਥਾਨਕ ਮੌਸਮ ਦੀ ਭਵਿੱਖਬਾਣੀ ਦੇਖੋ

# weatherPhraseRain
source: Best to stay indoors today
hi: आज घर के अंदर रहना अच्छा होगा
pa: ਅੱਜ ਘਰ ਦੇ ਅੰਦਰ ਰਹਿਣਾ ਚੰਗਾ ਹੋਵੇਗਾ

# weatherPhraseCloud
source: Moderate day for fieldwork
hi: खेती के लिए सामान्य दिन
pa: ਖੇਤੀ ਦੇ ਕੰਮ ਲਈ ਸਾਧਾਰਨ ਦਿਨ

# weatherPhraseClearHot
source: Stay hydrated in the fields
hi: खेतों में पानी पीते रहें
pa: ਖੇਤਾਂ ਵਿੱਚ ਪਾਣੀ ਪੀਂਦੇ ਰਹੋ

# weatherPhraseClear
source: Perfect day for outdoor work
hi: खुले में काम करने के लिए अच्छा दिन
pa: ਬਾਹਰੀ ਕੰਮ ਲਈ ਵਧੀਆ ਦਿਨ

# weatherPhraseSnow
source: Protect your crops today
hi: आज अपनी फसलों की रक्षा करें
pa: ਅੱਜ ਆਪਣੀਆਂ ਫਸਲਾਂ ਦੀ ਰੱਖਿਆ ਕਰੋ

# weatherPhraseCold
source: Quite cold for crop growth
hi: फसल की वृद्धि के लिए काफी ठंडा
pa: ਫਸਲ ਦੇ ਵਾਧੇ ਲਈ ਕਾਫ਼ੀ ਠੰਡਾ

# weatherPhraseHot
source: Watch for heat stress on crops
hi: फसलों पर गर्मी तनाव पर नज़र रखें
pa: ਫਸਲਾਂ ਉੱਤੇ ਗਰਮੀ ਦੇ ਤਣਾਅ ਦਾ ਧਿਆਨ ਰੱਖੋ

# weatherPhraseDefault
source: Good conditions for farming
hi: खेती के लिए अच्छी स्थिति
pa: ਖੇਤੀ ਲਈ ਵਧੀਆ ਹਾਲਾਤ

# chatbotTitle
source: Kisaan Assistant
hi: किसान सहायक
pa: ਕਿਸਾਨ ਸਹਾਇਕ

# farmingAssistant
source: Your Farming Assistant
hi: आपका कृषि सहायक
pa: ਤੁਹਾਡਾ ਖੇਤੀਬਾੜੀ ਸਹਾਇਕ

source: Reset Conversation
hi: बातचीत रीसेट करें
pa: ਗੱਲਬਾਤ ਰੀਸੈੱਟ ਕਰੋ

source: Scroll to bottom
hi: नीचे स्क्रॉल करें
pa: ਹੇਠਾਂ ਸਕ੍ਰੋਲ ਕਰੋ

# suggestedQuestions
source: Try asking:
hi: यह पूछकर देखें:
pa: ਇਹ ਪੁੱਛ ਕੇ ਦੇਖੋ:

source: Related Content:
hi: संबंधित जानकारी:
pa: ਸਬੰਧਤ ਸਮੱਗਰੀ:

source: Join Discussion
hi: चर्चा में शामिल हों
pa: ਚਰਚਾ ਵਿੱਚ ਸ਼ਾਮਲ ਹੋਵੋ

source: Check Weather
hi: मौसम जांचें
pa: ਮੌਸਮ ਚੈੱਕ ਕਰੋ

source: Learn More
hi: और जानें
pa: ਹੋਰ ਜਾਣੋ

source: Transport Services
hi: परिवहन सेवाएं
pa: ਟਰਾਂਸਪੋਰਟ ਸੇਵਾਵਾਂ

source: Weather Details
hi: मौसम का विवरण
pa: ਮੌਸਮ ਦਾ ਵੇਰਵਾ

# weatherDetailsDesc
source: Detailed weather information
hi: विस्तृत मौसम जानकारी
pa: ਵਿਸਤਰਿਤ ਮੌਸਮ ਜਾਣਕਾਰੀ

# listenPodcast
source: Listen to our Podcast
hi: हमारा पॉडकास्ट सुनें
pa: ਸਾਡਾ ਪੋਡਕਾਸਟ ਸੁਣੋ

source: Go to Marketplace
hi: मार्केटप्लेस पर जाएं
pa: ਮਾਰਕੀਟਪਲੇਸ 'ਤੇ ਜਾਓ

source: Explore Resources
hi: संसाधन खोजें
pa: ਸਰੋਤ ਖੋਜੋ

# communityDesc
source: Connect with other farmers
hi: अन्य किसानों से जुड़ें
pa: ਹੋਰ ਕਿਸਾਨਾਂ ਨਾਲ ਜੁੜੋ

# marketplaceDesc
source: Buy and sell farm products
hi: कृषि उत्पादों को खरीदें और बेचें
pa: ਖੇਤੀ ਉਤਪਾਦਾਂ ਨੂੰ ਖਰੀਦੋ ਅਤੇ ਵੇਚੋ

# resourcesDesc
source: Farming guides and resources
hi: खेती के मार्गदर्शिका और संसाधन
pa: ਖੇਤੀਬਾੜੀ ਗਾਈਡਾਂ ਅਤੇ ਸਰੋਤ

# relatedInfoDesc
source: Related information
hi: संबंधित जानकारी
pa: ਸਬੰਧਤ ਜਾਣਕਾਰੀ

source: Agri Help
hi: कृषि सहायता
pa: ਖੇਤੀਬਾੜੀ ਸਹਾਇਤਾ

source: Emergency Contacts
hi: आपातकालीन संपर्क
pa: ਐਮਰਜੈਂਸੀ ਸੰਪਰਕ

source: Frequently Asked Questions
hi: अक्सर पूछे जाने वाले प्रश्न
pa: ਅਕਸਰ ਪੁੱਛੇ ਜਾਂਦੇ ਸਵਾਲ

source: Call
hi: कॉल करें
pa: ਕਾਲ ਕਰੋ

source: Kisan Call Center
hi: किसान कॉल सेंटर
pa: ਕਿਸਾਨ ਕਾਲ ਸੈਂਟਰ

# kisanCallCenterDesc
source: 24x7 helpline for farmers' queries on agriculture and allied sectors
hi: कृषि और संबद्ध क्षेत्रों पर किसानों के प्रश्नों के लिए 24x7 हेल्पलाइन
pa: ਖੇਤੀਬਾੜੀ ਅਤੇ ਸਹਾਇਕ ਖੇਤਰਾਂ 'ਤੇ ਕਿਸਾਨਾਂ ਦੇ ਸਵਾਲਾਂ ਲਈ 24x7 ਹੈਲਪਲਾਈਨ

# agriInsuranceHelpline
source: Crop Insurance Helpline
hi: फसल बीमा हेल्पलाइन
pa: ਫਸਲ ਬੀਮਾ ਹੈਲਪਲਾਈਨ

# agriInsuranceDesc
source: Get help with crop insurance claims and information
hi: फसल बीमा दावों और जानकारी के साथ सहायता प्राप्त करें
pa: ਫਸਲ ਬੀਮਾ ਦਾਅਵਿਆਂ ਅਤੇ ਜਾਣਕਾਰੀ ਨਾਲ ਮਦਦ ਪ੍ਰਾਪਤ ਕਰੋ

source: Plant Protection Helpline
hi: पौधा संरक्षण हेल्पलाइन
pa: ਪੌਦਾ ਸੁਰੱਖਿਆ ਹੈਲਪਲਾਈਨ

# plantProtectionDesc
source: Expert advice on pest and disease management
hi: कीट और रोग प्रबंधन पर विशेषज्ञ सलाह
pa: ਕੀੜੇ ਅਤੇ ਰੋਗ ਪ੍ਰਬੰਧਨ 'ਤੇ ਮਾਹਰ ਸਲਾਹ

source: Seed Helpline
hi: बीज हेल्पलाइन
pa: ਬੀਜ ਹੈਲਪਲਾਈਨ

# seedHelplineDesc
source: Information about quality seeds and seed-related issues
hi: गुणवत्तापूर्ण बीज और बीज संबंधित मुद्दों के बारे में जानकारी
pa: ਗੁਣਵੱਤਾ ਵਾਲੇ ਬੀਜਾਂ ਅਤੇ ਬੀਜ ਸੰਬੰਧੀ ਮੁੱਦਿਆਂ ਬਾਰੇ ਜਾਣਕਾਰੀ

# faqSubsidyQuestion
source: How can I apply for agricultural subsidies?
hi: कृषि सब्सिडी के लिए आवेदन कैसे करें?
pa: ਮੈਂ ਖੇਤੀਬਾੜੀ ਸਬਸਿਡੀਆਂ ਲਈ ਕਿਵੇਂ ਅਪਲਾਈ ਕਰ ਸਕਦਾ ਹਾਂ?

# faqSubsidyAnswer
source: To apply for agricultural subsidies, register with your local agriculture office with your land documents, Aadhaar card, and bank account details. You can also apply online through the PM-KISAN portal or your state's agriculture department website. Eligibility varies by scheme.
hi: कृषि सब्सिडी के लिए आवेदन करने के लिए, अपने भूमि दस्तावेजों, आधार कार्ड और बैंक खाता विवरण के साथ अपने स्थानीय कृषि कार्यालय में पंजीकरण करें। आप पीएम-किसान पोर्टल या अपने राज्य के कृषि विभाग की वेबसाइट के माध्यम से ऑनलाइन भी आवेदन कर सकते हैं। पात्रता योजना के अनुसार भिन्न होती है।
pa: ਖੇਤੀਬਾੜੀ ਸਬਸਿਡੀਆਂ ਲਈ ਅਪਲਾਈ ਕਰਨ ਲਈ, ਆਪਣੇ ਜ਼ਮੀਨੀ ਦਸਤਾਵੇਜ਼ਾਂ, ਆਧਾਰ ਕਾਰਡ, ਅਤੇ ਬੈਂਕ ਖਾਤਾ ਵੇਰਵਿਆਂ ਦੇ ਨਾਲ ਆਪਣੇ ਸਥਾਨਕ ਖੇਤੀਬਾੜੀ ਦਫਤਰ ਦੇ ਨਾਲ ਰਜਿਸਟਰ ਕਰੋ। ਤੁਸੀਂ PM-KISAN ਪੋਰਟਲ ਜਾਂ ਆਪਣੇ ਰਾਜ ਦੇ ਖੇਤੀਬਾੜੀ ਵਿਭਾਗ ਦੀ ਵੈੱਬਸਾਈਟ ਰਾਹੀਂ ਵੀ ਆਨਲਾਈਨ ਅਪਲਾਈ ਕਰ ਸਕਦੇ ਹੋ। ਯੋਗਤਾ ਯੋਜਨਾ ਦੇ ਅਨੁਸਾਰ ਵੱਖਰੀ ਹੁੰਦੀ ਹੈ।

# faqPestControlQuestion
source: What are organic methods to control common pests?
hi: सामान्य कीटों को नियंत्रित करने के जैविक तरीके क्या हैं?
pa: ਆਮ ਕੀੜਿਆਂ ਨੂੰ ਨਿਯੰਤਰਣ ਕਰਨ ਦੇ ਜੈਵਿਕ ਤਰੀਕੇ ਕੀ ਹਨ?

# faqPestControlAnswer
source: Effective organic pest control methods include crop rotation, companion planting, and using neem oil spray. You can also introduce beneficial insects like ladybugs, use sticky traps, or apply garlic-chili spray. For specific pests, contact your local agriculture extension office.
hi: प्रभावी जैविक कीट नियंत्रण विधियों में फसल चक्र, साथी फसल लगाना और नीम तेल स्प्रे का उपयोग शामिल है। आप लाभकारी कीड़े जैसे लेडीबग्स भी पेश कर सकते हैं, चिपचिपे जाल का उपयोग कर सकते हैं, या लहसुन-मिर्च स्प्रे लगा सकते हैं। विशिष्ट कीटों के लिए, अपने स्थानीय कृषि विस्तार कार्यालय से संपर्क करें।
pa: ਪ੍ਰਭਾਵੀ ਜੈਵਿਕ ਕੀੜੇ ਨਿਯੰਤਰਣ ਵਿਧੀਆਂ ਵਿੱਚ ਫਸਲ ਰੋਟੇਸ਼ਨ, ਸਾਥੀ ਬੂਟੇ ਲਗਾਉਣਾ, ਅਤੇ ਨੀਮ ਦੇ ਤੇਲ ਦਾ ਸਪਰੇਅ ਵਰਤਣਾ ਸ਼ਾਮਲ ਹੈ। ਤੁਸੀਂ ਲਾਭਕਾਰੀ ਕੀੜਿਆਂ ਵਰਗੇ ਲੇਡੀਬੱਗਜ਼ ਵੀ ਪੇਸ਼ ਕਰ ਸਕਦੇ ਹੋ, ਚਿਪਕਣ ਵਾਲੇ ਟ੍ਰੈਪ ਵਰਤ ਸਕਦੇ ਹੋ, ਜਾਂ ਲਸਣ-ਮਿਰਚ ਸਪਰੇਅ ਲਗਾ ਸਕਦੇ ਹੋ। ਵਿਸ਼ੇਸ਼ ਕੀੜਿਆਂ ਲਈ, ਆਪਣੇ ਸਥਾਨਕ ਖੇਤੀਬਾੜੀ ਵਿਸਤਾਰ ਦਫਤਰ ਨਾਲ ਸੰਪਰਕ ਕਰੋ।

# faqSoilHealthQuestion
source: How can I improve my soil health naturally?
hi: मैं अपनी मिट्टी की स्वास्थ्य को प्राकृतिक रूप से कैसे सुधार सकता हूं?
pa: ਮੈਂ ਆਪਣੀ ਮਿੱਟੀ ਦੀ ਸਿਹਤ ਨੂੰ ਕੁਦਰਤੀ ਤੌਰ 'ਤੇ ਕਿਵੇਂ ਸੁਧਾਰ ਸਕਦਾ ਹਾਂ?

# faqSoilHealthAnswer
source: Improve soil health by adding organic matter like compost and farmyard manure, practicing crop rotation with legumes, using green manures, minimizing tillage, and maintaining proper drainage. Regular soil testing can help identify specific nutrient deficiencies to address.
hi: कंपोस्ट और खेत खाद जैसे जैविक पदार्थ जोड़कर, फलीदार पौधों के साथ फसल चक्र का अभ्यास करके, हरी खाद का उपयोग करके, जुताई को कम करके और उचित जल निकासी बनाए रखकर मिट्टी का स्वास्थ्य सुधारें। नियमित मिट्टी परीक्षण विशिष्ट पोषक तत्व की कमियों की पहचान करने में मदद कर सकता है।
pa: ਕੰਪੋਸਟ ਅਤੇ ਖੇਤ ਦੀ ਖਾਦ ਵਰਗੇ ਜੈਵਿਕ ਪਦਾਰਥ ਜੋੜ ਕੇ, ਫਲੀਦਾਰ ਪੌਦਿਆਂ ਨਾਲ ਫਸਲ ਰੋਟੇਸ਼ਨ ਦਾ ਅਭਿਆਸ ਕਰਕੇ, ਹਰੀ ਖਾਦ ਵਰਤ ਕੇ, ਵਾਹੁਣ ਨੂੰ ਘੱਟ ਕਰਕੇ, ਅਤੇ ਢੁਕਵੀਂ ਨਿਕਾਸੀ ਬਣਾਈ ਰੱਖ ਕੇ ਮਿੱਟੀ ਦੀ ਸਿਹਤ ਵਿੱਚ ਸੁਧਾਰ ਕਰੋ। ਨਿਯਮਤ ਮਿੱਟੀ ਟੈਸਟਿੰਗ ਵਿਸ਼ੇਸ਼ ਪੋਸ਼ਕ ਤੱਤਾਂ ਦੀ ਕਮੀ ਦੀ ਪਛਾਣ ਕਰਨ ਵਿੱਚ ਮਦਦ ਕਰ ਸਕਦੀ ਹੈ।

# faqWeatherImpactQuestion
source: How can I protect crops during extreme weather?
hi: मैं चरम मौसम के दौरान फसलों की रक्षा कैसे कर सकता हूं?
pa: ਮੈਂ ਚਰਮ ਮੌਸਮ ਦੌਰਾਨ ਫ਼ਸਲਾਂ ਦੀ ਰੱਖਿਆ ਕਿਵੇਂ ਕਰ ਸਕਦਾ ਹਾਂ?

# faqWeatherImpactAnswer
source: Protect crops during extreme weather by using windbreaks, shade cloths, and mulching. For drought, implement drip irrigation and moisture retention practices. For heavy rains, ensure proper drainage and use raised beds. Consider weather-resistant crop varieties and check weather alerts regularly.
hi: हवारोधक, छाया कपड़े और मल्चिंग का उपयोग करके चरम मौसम के दौरान फसलों की रक्षा करें। सूखे के लिए, ड्रिप सिंचाई और नमी प्रतिधारण प्रथाओं को लागू करें। भारी बारिश के लिए, उचित जल निकासी सुनिश्चित करें और उठे हुए बेड का उपयोग करें। मौसम-प्रतिरोधी फसल किस्मों पर विचार करें और नियमित रूप से मौसम अलर्ट देखें।
pa: ਹਵਾ ਰੋਕਣ ਵਾਲੇ, ਛਾਂ ਕੱਪੜੇ, ਅਤੇ ਮਲਚਿੰਗ ਦੀ ਵਰਤੋਂ ਕਰਕੇ ਚਰਮ ਮੌਸਮ ਦੌਰਾਨ ਫ਼ਸਲਾਂ ਦੀ ਰੱਖਿਆ ਕਰੋ। ਸੋਕੇ ਲਈ, ਡ੍ਰਿਪ ਸਿੰਚਾਈ ਅਤੇ ਨਮੀ ਬਣਾਈ ਰੱਖਣ ਦੇ ਤਰੀਕੇ ਲਾਗੂ ਕਰੋ। ਭਾਰੀ ਮੀਂਹ ਲਈ, ਢੁਕਵੀਂ ਨਿਕਾਸੀ ਯਕੀਨੀ ਬਣਾਓ ਅਤੇ ਉੱਚੇ ਬਿਸਤਰੇ ਵਰਤੋ। ਮੌਸਮ-ਪ੍ਰਤੀਰੋਧੀ ਫਸਲ ਕਿਸਮਾਂ 'ਤੇ ਵਿਚਾਰ ਕਰੋ ਅਤੇ ਨਿਯਮਿਤ ਤੌਰ 'ਤੇ ਮੌਸਮ ਚੇਤਾਵਨੀਆਂ ਦੀ ਜਾਂਚ ਕਰੋ।

# faqCropInsuranceQuestion
source: How does the crop insurance scheme work?
hi: फसल बीमा योजना कैसे काम करती है?
pa: ਫਸਲ ਬੀਮਾ ਯੋਜਨਾ ਕਿਵੇਂ ਕੰਮ ਕਰਦੀ ਹੈ?

# faqCropInsuranceAnswer
source: The Pradhan Mantri Fasal Bima Yojana (PMFBY) provides financial support to farmers suffering crop loss. Premium rates are 2% for kharif crops, 1.5% for rabi crops, and 5% for commercial crops. Register at your bank or Common Service Centre with land records and premium payment. Claims are assessed based on crop cutting experiments.
hi: प्रधानमंत्री फसल बीमा योजना (PMFBY) फसल हानि से पीड़ित किसानों को वित्तीय सहायता प्रदान करती है। प्रीमियम दरें खरीफ फसलों के लिए 2%, रबी फसलों के लिए 1.5% और वाणिज्यिक फसलों के लिए 5% हैं। भूमि रिकॉर्ड और प्रीमियम भुगतान के साथ अपने बैंक या कॉमन सर्विस सेंटर में पंजीकरण करें। दावों का मूल्यांकन फसल कटाई प्रयोगों के आधार पर किया जाता है।
pa: ਪ੍ਰਧਾਨ ਮੰਤਰੀ ਫਸਲ ਬੀਮਾ ਯੋਜਨਾ (PMFBY) ਫਸਲ ਦੇ ਨੁਕਸਾਨ ਨੂੰ ਝੱਲ ਰਹੇ ਕਿਸਾਨਾਂ ਨੂੰ ਵਿੱਤੀ ਸਹਾਇਤਾ ਪ੍ਰਦਾਨ ਕਰਦੀ ਹੈ। ਪ੍ਰੀਮੀਅਮ ਦਰਾਂ ਖਰੀਫ ਫਸਲਾਂ ਲਈ 2%, ਰਬੀ ਫਸਲਾਂ ਲਈ 1.5%, ਅਤੇ ਵਪਾਰਕ ਫਸਲਾਂ ਲਈ 5% ਹਨ। ਜ਼ਮੀਨੀ ਰਿਕਾਰਡ ਅਤੇ ਪ੍ਰੀਮੀਅਮ ਭੁਗਤਾਨ ਦੇ ਨਾਲ ਆਪਣੇ ਬੈਂਕ ਜਾਂ ਕਾਮਨ ਸਰਵਿਸ ਸੈਂਟਰ 'ਤੇ ਰਜਿਸਟਰ ਕਰੋ। ਦਾਅਵਿਆਂ ਦਾ ਮੁਲਾਂਕਣ ਫਸਲ ਕਟਾਈ ਪ੍ਰਯੋਗਾਂ ਦੇ ਆਧਾਰ 'ਤੇ ਕੀਤਾ ਜਾਂਦਾ ਹੈ।
